---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.PathReinforcementType
source: html/76a09218-cbbf-7852-95d7-efc89dd25115.htm
---
# PathReinforcementType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.